In [9]:
import numpy as np
import pandas as pd

# Walkthrough_Pandas_Viewing_and_Filtering
## Lighthouse Labs
### Instructor: Socorro Dominguez

References for in deep detail:
https://prog-learn.mds.ubc.ca/en/

In [2]:
array = np.array([3, 6, 9, 12])
division = array/3
print(division)
print (type(division))

[1. 2. 3. 4.]
<class 'numpy.ndarray'>

In [3]:
list_a = [3, 6, 9, 12]
division_2 = list_a/3
print(division_2)

TypeError: unsupported operand type(s) for /: 'list' and 'int'

In [4]:
my_array = np.array(list_a)

In [6]:
division_2 = my_array/3
division_2

array([1., 2., 3., 4.])

In [7]:
list2 = ['hola', 2, 4]

In [8]:
list2

['hola', 2, 4]

## Walkthrough

In [10]:
import pandas as pd
import numpy as np

How to create a pandas series?

In [13]:
s = pd.Series([1, 3 , np.nan, 6])

In [14]:
s

0    1.0
1    3.0
2    NaN
3    6.0
dtype: float64

How to create a Date - Time object?

In [16]:
dates = pd.date_range('20130101', periods = 6)

In [17]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = list('ABCD'))

In [19]:
df

                   A         B         C         D
2013-01-01  1.006043 -1.608709 -0.118445  2.110216
2013-01-02 -0.607734 -0.383397  0.770335  0.007024
2013-01-03  0.050598 -0.061827  2.067650 -0.708274
2013-01-04 -0.001995 -0.277531  0.110166 -1.067209
2013-01-05  0.874025  0.279592 -0.013909  1.176537
2013-01-06 -0.071483 -2.122988  0.560978  0.594683

Datafrome from Dictionary Objects

In [26]:
my_dict = {'A': 1.,
'B': pd.Timestamp('20130102'),
'C': pd.Series(1, index=list(range(6)), dtype ='float32')}

In [36]:
df2= pd.DataFrame(my_dict)
df2

     A          B    C
0  1.0 2013-01-02  1.0
1  1.0 2013-01-02  1.0
2  1.0 2013-01-02  1.0
3  1.0 2013-01-02  1.0
4  1.0 2013-01-02  1.0
5  1.0 2013-01-02  1.0

In [29]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
dtype: object

In [30]:
df2.A

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
5    1.0
Name: A, dtype: float64

In [32]:
df2.head(1)

     A          B    C
0  1.0 2013-01-02  1.0

In [33]:
df2.tail(2)

     A          B    C
4  1.0 2013-01-02  1.0
5  1.0 2013-01-02  1.0

In [34]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [37]:
df2.index

Int64Index([0, 1, 2, 3, 4, 5], dtype='int64')

In [38]:
df2.describe()

         A    C
count  6.0  6.0
mean   1.0  1.0
std    0.0  0.0
min    1.0  1.0
25%    1.0  1.0
50%    1.0  1.0
75%    1.0  1.0
max    1.0  1.0

In [43]:
df.sort_index(axis=1, ascending = False)

                   D         C         B         A
2013-01-01 -0.162700 -1.246570 -0.444063  0.110175
2013-01-02  0.556898  1.253210  0.189549 -2.694438
2013-01-03 -0.979426 -0.271609  0.200220 -0.246122
2013-01-04  0.495979  0.004044 -0.190268  1.231014
2013-01-05 -0.187016  1.075468  3.061172 -0.913936
2013-01-06  1.033776  0.273546 -0.034852  1.142558

In [44]:
df.sort_index(axis=0, ascending = False)

                   A         B         C         D
2013-01-06  1.142558 -0.034852  0.273546  1.033776
2013-01-05 -0.913936  3.061172  1.075468 -0.187016
2013-01-04  1.231014 -0.190268  0.004044  0.495979
2013-01-03 -0.246122  0.200220 -0.271609 -0.979426
2013-01-02 -2.694438  0.189549  1.253210  0.556898
2013-01-01  0.110175 -0.444063 -1.246570 -0.162700

In [45]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  0.110175 -0.444063 -1.246570 -0.162700
2013-01-04  1.231014 -0.190268  0.004044  0.495979
2013-01-06  1.142558 -0.034852  0.273546  1.033776
2013-01-02 -2.694438  0.189549  1.253210  0.556898
2013-01-03 -0.246122  0.200220 -0.271609 -0.979426
2013-01-05 -0.913936  3.061172  1.075468 -0.187016

In [47]:
df['A']

2013-01-01    0.110175
2013-01-02   -2.694438
2013-01-03   -0.246122
2013-01-04    1.231014
2013-01-05   -0.913936
2013-01-06    1.142558
Freq: D, Name: A, dtype: float64

In [54]:
list_a = ['A', 'B']

In [55]:
df[list_a]

                   A         B
2013-01-01  0.110175 -0.444063
2013-01-02 -2.694438  0.189549
2013-01-03 -0.246122  0.200220
2013-01-04  1.231014 -0.190268
2013-01-05 -0.913936  3.061172
2013-01-06  1.142558 -0.034852

In [51]:
df.loc['2013-01-04']

A    1.231014
B   -0.190268
C    0.004044
D    0.495979
Name: 2013-01-04 00:00:00, dtype: float64

In [56]:
df.loc['2013-01-04':'2013-01-06', ['A', 'B']]

                   A         B
2013-01-04  1.231014 -0.190268
2013-01-05 -0.913936  3.061172
2013-01-06  1.142558 -0.034852

In [58]:
df

                   A         B         C         D
2013-01-01  0.110175 -0.444063 -1.246570 -0.162700
2013-01-02 -2.694438  0.189549  1.253210  0.556898
2013-01-03 -0.246122  0.200220 -0.271609 -0.979426
2013-01-04  1.231014 -0.190268  0.004044  0.495979
2013-01-05 -0.913936  3.061172  1.075468 -0.187016
2013-01-06  1.142558 -0.034852  0.273546  1.033776

In [57]:
df.iloc[3]

A    1.231014
B   -0.190268
C    0.004044
D    0.495979
Name: 2013-01-04 00:00:00, dtype: float64

In [59]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  0.110175 -0.444063 -1.246570 -0.162700
2013-01-04  1.231014 -0.190268  0.004044  0.495979
2013-01-06  1.142558 -0.034852  0.273546  1.033776

In [60]:
df["A"] >0

2013-01-01     True
2013-01-02    False
2013-01-03    False
2013-01-04     True
2013-01-05    False
2013-01-06     True
Freq: D, Name: A, dtype: bool

## Merge

In [61]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.648377  0.886526  0.524756 -0.125578
1  0.362842  0.279463 -0.759715  0.855932
2 -0.771560  0.649402 -0.521591 -1.243535
3 -0.376242  0.050527  1.232852 -1.117746
4  1.174980 -2.264210  0.576544 -0.428687
5  0.105962  0.865293  1.451677 -0.652156
6 -0.220922  0.128698 -0.821013 -0.120524
7  0.445342 -0.347907  0.813661  0.725268
8 -0.646230 -0.218101 -0.126674 -0.378674
9  0.192906 -0.645325  1.619738 -0.676031

In [62]:
pieces = [df[:3], df[3:7], df[7:]]

In [63]:
pieces

[          0         1         2         3
 0  0.648377  0.886526  0.524756 -0.125578
 1  0.362842  0.279463 -0.759715  0.855932
 2 -0.771560  0.649402 -0.521591 -1.243535,
           0         1         2         3
 3 -0.376242  0.050527  1.232852 -1.117746
 4  1.174980 -2.264210  0.576544 -0.428687
 5  0.105962  0.865293  1.451677 -0.652156
 6 -0.220922  0.128698 -0.821013 -0.120524,
           0         1         2         3
 7  0.445342 -0.347907  0.813661  0.725268
 8 -0.646230 -0.218101 -0.126674 -0.378674
 9  0.192906 -0.645325  1.619738 -0.676031]

In [64]:
pd.concat(pieces)

          0         1         2         3
0  0.648377  0.886526  0.524756 -0.125578
1  0.362842  0.279463 -0.759715  0.855932
2 -0.771560  0.649402 -0.521591 -1.243535
3 -0.376242  0.050527  1.232852 -1.117746
4  1.174980 -2.264210  0.576544 -0.428687
5  0.105962  0.865293  1.451677 -0.652156
6 -0.220922  0.128698 -0.821013 -0.120524
7  0.445342 -0.347907  0.813661  0.725268
8 -0.646230 -0.218101 -0.126674 -0.378674
9  0.192906 -0.645325  1.619738 -0.676031

In [65]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval':[1,2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'lval':[4,5]})

In [66]:
left

   key  lval
0  foo     1
1  bar     2

In [67]:
right

   key  lval
0  foo     4
1  bar     5

In [68]:
pd.merge(left, right, on = 'key')

   key  lval_x  lval_y
0  foo       1       4
1  bar       2       5

## Grouping

In [71]:
df = pd.DataFrame({'A': ['foo', 'bar','foo', 'bar'],
                  'B': ['one', 'one', 'two', 'three'], 
                  'C': np.random.randn(4),
                  'D': np.random.randn(4)})
df

     A      B         C         D
0  foo    one -2.695219  1.569412
1  bar    one -1.243725 -1.054348
2  foo    two  1.683885 -1.599057
3  bar  three  1.203123 -1.455012

In [75]:
df.groupby('A',as_index=False).sum()

     A         C         D
0  bar -0.040602 -2.509360
1  foo -1.011334 -0.029645

In [76]:
df.groupby('A').agg({'C': np.sum, 'D': np.max})

            C         D
A
bar -0.040602 -1.054348
foo -1.011334  1.569412

## Stack

In [78]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                   ['one', 'two','one', 'two','one', 'two','one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [80]:
index = pd.MultiIndex.from_tuples(tuples, names = ['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [100]:
stacked = pd.DataFrame(np.random.randn(8,2), index = index, columns=['A', 'B'])
stacked

                     A         B
first second
bar   one     0.656127  0.031496
      two    -1.176098  0.475870
baz   one    -0.072609  0.251039
      two     0.018172  2.734057
foo   one     1.229154  1.159176
      two    -0.534033  1.101262
qux   one     1.094246  0.752578
      two    -0.027386 -1.214219

In [101]:
stacked.stack()

first  second
bar    one     A    0.656127
               B    0.031496
       two     A   -1.176098
               B    0.475870
baz    one     A   -0.072609
               B    0.251039
       two     A    0.018172
               B    2.734057
foo    one     A    1.229154
               B    1.159176
       two     A   -0.534033
               B    1.101262
qux    one     A    1.094246
               B    0.752578
       two     A   -0.027386
               B   -1.214219
dtype: float64

In [85]:
df2=df[:4]
df2

                     A         B
first second
bar   one     1.987894 -0.009063
      two     1.079026  2.468136
baz   one    -0.614211  0.120574
      two    -1.203647 -1.142339

In [89]:
stacked.unstack()

               A                   B
second       one       two       one       two
first
bar    -1.788700 -1.108671  0.314095  0.628103
baz     1.576446  0.759116  1.935107  0.284899
foo     0.561417 -0.550103  1.966974 -0.260639
qux    -0.693321  0.408372 -0.463284  1.086289

In [91]:
df.stack()

first  second
bar    one     A    1.987894
               B   -0.009063
       two     A    1.079026
               B    2.468136
baz    one     A   -0.614211
               B    0.120574
       two     A   -1.203647
               B   -1.142339
foo    one     A   -0.551368
               B   -0.865405
       two     A   -1.366066
               B   -0.682610
qux    one     A    0.705325
               B   -0.891393
       two     A    0.785161
               B   -1.627608
dtype: float64

In [92]:
df.unstack()

               A                   B
second       one       two       one       two
first
bar     1.987894  1.079026 -0.009063  2.468136
baz    -0.614211 -1.203647  0.120574 -1.142339
foo    -0.551368 -1.366066 -0.865405 -0.682610
qux     0.705325  0.785161 -0.891393 -1.627608

In [94]:
df.unstack(0)

               A                                       B                      \
first        bar       baz       foo       qux       bar       baz       foo
second
one     1.987894 -0.614211 -0.551368  0.705325 -0.009063  0.120574 -0.865405
two     1.079026 -1.203647 -1.366066  0.785161  2.468136 -1.142339 -0.682610


first        qux
second
one    -0.891393
two    -1.627608

In [102]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})

In [103]:
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [99]:
pd.pivot_table(df, values='D', index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum)

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0